OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_14.0.0_3bcc1f7/components/libraries/usbd/class/msc/app_usbd_msc.c
            if (p_setup_ev->setup.wValue.w != 0)
            {
                break;
            }

            if (p_setup_ev->setup.wLength.w != 1)
            {
                break;
            }

            size_t tx_size;
            uint16_t * p_tx_buff = app_usbd_core_setup_transfer_buff_get(&tx_size);
            ASSERT(p_msc->specific.inst.block_devs_count != 0);
            p_tx_buff[0] = p_msc->specific.inst.block_devs_count - 1;

            ret_code_t ret = cbw_wait_start(p_inst);
            UNUSED_VARIABLE(ret);
            return app_usbd_core_setup_rsp(&(p_setup_ev->setup), p_tx_buff, sizeof(uint8_t));
        }
        default:
            break;

    }

    return NRF_ERROR_NOT_SUPPORTED;
}

/**
 * @brief Internal SETUP class OUT request handler
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_setup_ev    Setup event
 *
 * @return Standard error code
 * @retval NRF_SUCCESS if request handled correctly
 * @retval NRF_ERROR_NOT_SUPPORTED if request is not supported
 */
static ret_code_t setup_req_class_out(app_usbd_class_inst_t const * p_inst,
                                      app_usbd_setup_evt_t const *  p_setup_ev)
{
    app_usbd_msc_t const * p_msc = msc_get(p_inst);
    app_usbd_msc_ctx_t *   p_msc_ctx = msc_ctx_get(p_msc);

    switch (p_setup_ev->setup.bmRequest)
    {
        case APP_USBD_MSC_REQ_BULK_RESET:
        {
            if (p_setup_ev->setup.wValue.w != 0)
            {
                break;
            }

            if (p_setup_ev->setup.wLength.w != 0)
            {
                break;
            }

            /*
             * Reset internal state to be ready for next CBW
             */
            NRF_LOG_DEBUG("bulk ep reset");
            bulk_ep_reset(p_inst);

            if (p_msc_ctx->state == APP_USBD_MSC_STATE_DISABLED)
            {
                ret_code_t ret = cbw_wait_start(p_inst);
                UNUSED_VARIABLE(ret);
            }

            return NRF_SUCCESS;
        }
        default:
            break;
    }

    return NRF_ERROR_NOT_SUPPORTED;
}

/**
 * @brief Control endpoint handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_setup_ev    Setup event
 *
 * @return Standard error code
 * @retval NRF_SUCCESS if request handled correctly
 * @retval NRF_ERROR_NOT_SUPPORTED if request is not supported
 */
static ret_code_t setup_event_handler(app_usbd_class_inst_t const * p_inst,
                                      app_usbd_setup_evt_t const *  p_setup_ev)
{
    ASSERT(p_inst != NULL);
    ASSERT(p_setup_ev != NULL);
    app_usbd_msc_t const * p_msc = msc_get(p_inst);
    app_usbd_msc_ctx_t *   p_msc_ctx = msc_ctx_get(p_msc);

    app_usbd_setup_reqrec_t  req_rec = app_usbd_setup_req_rec(p_setup_ev->setup.bmRequestType);
    app_usbd_setup_reqtype_t req_type = app_usbd_setup_req_typ(p_setup_ev->setup.bmRequestType);
    if (req_rec == APP_USBD_SETUP_REQREC_ENDPOINT &&
        req_type == APP_USBD_SETUP_REQTYPE_STD)
    {

        ret_code_t ret = app_usbd_endpoint_std_req_handle(p_setup_ev);
        if (ret != NRF_SUCCESS)
        {
            return ret;
        }

        if ((p_setup_ev->setup.bmRequest == APP_USBD_SETUP_STDREQ_CLEAR_FEATURE) &&
            (p_msc_ctx->state == APP_USBD_MSC_STATE_UNSUPPORTED))
        {
            /*Unsupported command handle: status stage*/
            ret = csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_FAIL);
        }

        return ret;
    }

    if (app_usbd_setup_req_dir(p_setup_ev->setup.bmRequestType) == APP_USBD_SETUP_REQDIR_IN)
    {
        switch (app_usbd_setup_req_typ(p_setup_ev->setup.bmRequestType))
        {
            case APP_USBD_SETUP_REQTYPE_STD:
                return setup_req_std_in(p_inst, p_setup_ev);
            case APP_USBD_SETUP_REQTYPE_CLASS:
                return setup_req_class_in(p_inst, p_setup_ev);
            default:
                break;
        }
    }
    else /*APP_USBD_SETUP_REQDIR_OUT*/
    {
        switch (app_usbd_setup_req_typ(p_setup_ev->setup.bmRequestType))
        {
            case APP_USBD_SETUP_REQTYPE_STD:
                return setup_req_std_out(p_inst, p_setup_ev);
            case APP_USBD_SETUP_REQTYPE_CLASS:
                return setup_req_class_out(p_inst, p_setup_ev);
            default:
                break;
        }
    }

    return NRF_ERROR_NOT_SUPPORTED;
}

/**
 * @brief Handle read6/read10 command data stage
 *
 * @param[in] p_inst        Generic class instance
 *
 * @return Standard error code
 * @retval NRF_SUCCESS if request handled correctly
 * @retval NRF_ERROR_NOT_SUPPORTED if request is not supported
 */
static ret_code_t state_data_in_handle(app_usbd_class_inst_t const * p_inst)
{
    app_usbd_msc_t const * p_msc = msc_get(p_inst);
    app_usbd_msc_ctx_t *   p_msc_ctx = msc_ctx_get(p_msc);

    ret_code_t ret = NRF_SUCCESS;

    p_msc_ctx->current.trans_in_progress = false;
    APP_USBD_MSC_REQ_BUSY_CLR(p_msc_ctx->current.req_busy_mask, p_msc_ctx->current.trans_req_id);

    if (p_msc_ctx->current.blk_datasize == 0 && p_msc_ctx->current.req_busy_mask == 0)
    {
        p_msc_ctx->current.blk_idx = p_msc_ctx->current.blk_size = 0;
        ret = csw_wait_start(p_inst, p_msc_ctx->current.csw_status);
        return ret;
    }

    ASSERT(p_msc_ctx->current.blk_size != 0);

    if (p_msc_ctx->current.req_busy_mask == 0)
    {
        nrf_block_dev_t const * p_blkd =
                                p_msc->specific.inst.pp_block_devs[p_msc_ctx->current.lun];

        /*Trigger new block read request*/
        p_msc_ctx->current.workbuff_pos ^= p_msc->specific.inst.block_buff_size;
        uint32_t req_pos = p_msc_ctx->current.workbuff_pos != 0 ? 1 : 0;
        APP_USBD_MSC_REQ_BUSY_SET(p_msc_ctx->current.req_busy_mask, req_pos);

        NRF_BLOCK_DEV_REQUEST(req,
                              p_msc_ctx->current.blk_idx,
                              p_msc_ctx->current.blk_count,
                              ((uint8_t *)p_msc->specific.inst.p_block_buff +
                              p_msc_ctx->current.workbuff_pos));

        NRF_LOG_DEBUG("nrf_blk_dev_read_req 3: id: %u, count: %u, left: %u, ptr: %p",
                      req.blk_id,
                      req.blk_count,
                      p_msc_ctx->current.blk_datasize,
                      (uint32_t)req.p_buff);

        ret = nrf_blk_dev_read_req(p_blkd, &req);
        NRF_LOG_DEBUG("nrf_blk_dev_read_req 3: ret: %u", ret);
        return ret;
    }

    uint32_t blk_size = p_msc_ctx->current.blk_size;
    p_msc_ctx->current.trans_req_id ^= 1;

