OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_14.0.0_3bcc1f7/components/libraries/usbd/class/msc/app_usbd_msc.c
    nrf_block_req_t * p_req = &p_msc_ctx->current.req;
    if (p_req->p_buff == NULL)
    {
        p_msc_ctx->current.trans_req_id ^= 1;
        return NRF_SUCCESS;
    }

    ret = transfer_in_start(p_inst,
                            p_req->p_buff,
                            p_req->blk_count * blk_size,
                            APP_USBD_MSC_STATE_DATA_IN);

    if (ret == NRF_SUCCESS)
    {
        /*Clear processed block request.*/
        memset(p_req, 0, sizeof(nrf_block_req_t));
        p_msc_ctx->current.trans_in_progress = true;
    }

    return ret;
}

/**
 * @brief Endpoint IN event handler
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_setup_ev    Setup event
 *
 * @return Standard error code
 * @retval NRF_SUCCESS if request handled correctly
 * @retval NRF_ERROR_NOT_SUPPORTED if request is not supported
 */
static ret_code_t endpoint_in_event_handler(app_usbd_class_inst_t const *  p_inst,
                                            app_usbd_complex_evt_t const * p_event)
{
    app_usbd_msc_t const * p_msc = msc_get(p_inst);
    app_usbd_msc_ctx_t *   p_msc_ctx = msc_ctx_get(p_msc);

    NRF_LOG_DEBUG("state: %d, ep in event, status: %d",
                  p_msc_ctx->state,
                  p_event->drv_evt.data.eptransfer.status);

    if (p_event->drv_evt.data.eptransfer.status != NRF_USBD_EP_OK)
    {
        return NRF_SUCCESS;
    }

    ret_code_t ret = NRF_SUCCESS;
    switch (p_msc_ctx->state) {
        case APP_USBD_MSC_STATE_CMD_IN:
        {
            ret = csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_PASS);
            break;
        }
        case APP_USBD_MSC_STATE_DATA_IN:
        {
            CRITICAL_REGION_ENTER();
            ret = state_data_in_handle(p_inst);
            CRITICAL_REGION_EXIT();

            break;
        }
        case APP_USBD_MSC_STATE_CSW:
        {
            break;
        }
        case APP_USBD_MSC_STATE_DATA_OUT:
        {
            break;
        }
        case APP_USBD_MSC_STATE_UNSUPPORTED:
        {
            ret = NRF_ERROR_NOT_SUPPORTED;
            break;
        }
        default:
        {
            ret = NRF_ERROR_INTERNAL;
            break;
        }
    }

    return ret;
}


/**
 * @brief Helper function to calculate next block transfer block count
 *
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 *
 * @return Blocks to transfer
 * */
static uint32_t next_transfer_blkcnt_calc(app_usbd_msc_t const * p_msc,
                                          app_usbd_msc_ctx_t *   p_msc_ctx)
{
    uint32_t blkcnt = p_msc->specific.inst.block_buff_size / p_msc_ctx->current.blk_size;
    if (blkcnt > (p_msc_ctx->current.blk_datasize / p_msc_ctx->current.blk_size))
    {
        blkcnt = p_msc_ctx->current.blk_datasize / p_msc_ctx->current.blk_size;
    }

    return blkcnt;
}

/**
 * @brief Helper function to calculate next transfer size
 *
 * @param[in] p_msc_ctx     MSC context
 *
 * @return Blocks to transfer
 * */
static uint32_t next_transfer_size_calc(app_usbd_msc_ctx_t * p_msc_ctx)
{
    uint32_t blk_cnt = p_msc_ctx->current.blk_count;
    uint32_t blk_size = p_msc_ctx->current.blk_size;

    return p_msc_ctx->current.blk_datasize > blk_size * blk_cnt ?
           blk_size * blk_cnt : p_msc_ctx->current.blk_datasize;
}

/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_TESTUNITREADY handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_testunitready(app_usbd_class_inst_t const * p_inst,
                                    app_usbd_msc_t const *        p_msc,
                                    app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: TESTUNITREADY");
    if (uint32_decode(p_msc_ctx->cbw.datlen) != 0)
    {
        return unsupported_start(p_inst);
    }

    if (p_msc_ctx->cbw.cdb_length != APP_USBD_SCSI_CMD_TESTUNITREADY_LEN)
    {
        return unsupported_start(p_inst);
    }

    if (p_msc_ctx->cbw.lun >= p_msc->specific.inst.block_devs_count)
    {
        return unsupported_start(p_inst);
    }

    return csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_PASS);
}

/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_REQUESTSENSE handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_requestsense(app_usbd_class_inst_t const * p_inst,
                                   app_usbd_msc_t const *        p_msc,
                                   app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: REQUESTSENSE");
    app_usbd_scsi_cmd_requestsense_t const * p_reqs =  (const void *)p_msc_ctx->cbw.cdb;
    UNUSED_VARIABLE(p_reqs);

    if ((p_msc_ctx->cbw.cdb_length < sizeof(app_usbd_scsi_cmd_requestsense_t)))
    {
        return unsupported_start(p_inst);
    }

    if (p_msc_ctx->cbw.lun >= p_msc->specific.inst.block_devs_count)
    {
        return unsupported_start(p_inst);
    }

    p_msc_ctx->resp_len = uint32_decode(p_msc_ctx->cbw.datlen);
    p_msc_ctx->resp_len = MIN(p_msc_ctx->resp_len,
                              sizeof(app_usbd_scsi_cmd_requestsense_resp_t));

    if (p_msc_ctx->resp_len == 0)
    {
        return csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_PASS);
    }

    memset(&p_msc_ctx->scsi_resp, 0, sizeof(app_usbd_scsi_cmd_requestsense_resp_t));
    p_msc_ctx->scsi_resp.requestsense.code = APP_USBD_SCSI_CMD_REQSENSE_CODE_VALID |
                                             APP_USBD_SCSI_CMD_REQSENSE_CODE_CURRENT;

    p_msc_ctx->scsi_resp.requestsense.len = sizeof(app_usbd_scsi_cmd_requestsense_resp_t) -
                                            offsetof(app_usbd_scsi_cmd_requestsense_resp_t, len);

    return transfer_in_start(p_inst,
                             &p_msc_ctx->scsi_resp,
                             p_msc_ctx->resp_len,
                             APP_USBD_MSC_STATE_CMD_IN);
}


/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_FORMAT_UNIT handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_formatunit(app_usbd_class_inst_t const * p_inst,
                                 app_usbd_msc_t const *        p_msc,
                                 app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: FORMAT_UNIT");
    return unsupported_start(p_inst);
}

static ret_code_t cmd_read_start(app_usbd_class_inst_t const * p_inst,
                                 app_usbd_msc_t const *        p_msc,
                                 app_usbd_msc_ctx_t *          p_msc_ctx)
{
    nrf_block_dev_t const * p_blkd = p_msc->specific.inst.pp_block_devs[p_msc_ctx->cbw.lun];

