OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_14.0.0_3bcc1f7/components/libraries/usbd/class/msc/app_usbd_msc.c
    p_msc_ctx->current.trans_in_progress = false;
    p_msc_ctx->current.req_busy_mask = 0;
    p_msc_ctx->current.workbuff_pos = 0;

    APP_USBD_MSC_REQ_BUSY_SET(p_msc_ctx->current.req_busy_mask, 0);
    NRF_BLOCK_DEV_REQUEST(req,
                          p_msc_ctx->current.blk_idx,
                          p_msc_ctx->current.blk_count,
                          ((uint8_t *)p_msc->specific.inst.p_block_buff +
                          p_msc_ctx->current.workbuff_pos));

    NRF_LOG_DEBUG("cmd_read_start");
    NRF_LOG_DEBUG("nrf_blk_dev_read_req 1: id: %u, count: %u, left: %u, ptr: %p",
                  req.blk_id,
                  req.blk_count,
                  p_msc_ctx->current.blk_datasize,
                  (uint32_t)req.p_buff);

    ret_code_t ret = nrf_blk_dev_read_req(p_blkd, &req);
    NRF_LOG_DEBUG("nrf_blk_dev_read_req 1: ret: %u", ret);

    return ret;
}

/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_READ6 handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_read6(app_usbd_class_inst_t const * p_inst,
                            app_usbd_msc_t const *        p_msc,
                            app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: READ6");
    app_usbd_scsi_cmd_read6_t const * p_read6 = (const void *)p_msc_ctx->cbw.cdb;
    if (p_msc_ctx->cbw.cdb_length < sizeof(app_usbd_scsi_cmd_read6_t))
    {
        return unsupported_start(p_inst);
    }

    if (p_msc_ctx->cbw.lun >= p_msc->specific.inst.block_devs_count)
    {
        return unsupported_start(p_inst);
    }

    nrf_block_dev_t const * p_blkd = p_msc->specific.inst.pp_block_devs[p_msc_ctx->cbw.lun];

    p_msc_ctx->current.lun = p_msc_ctx->cbw.lun;
    p_msc_ctx->current.blk_idx = ((p_read6->mslba & 0x1F) << 16) |
                                   uint16_big_decode(p_read6->lslba);
    p_msc_ctx->current.blk_datasize = uint32_decode(p_msc_ctx->cbw.datlen);
    p_msc_ctx->current.blk_size = nrf_blk_dev_geometry(p_blkd)->blk_size;
    p_msc_ctx->current.blk_count = next_transfer_blkcnt_calc(p_msc, p_msc_ctx);

    if (p_msc_ctx->current.blk_datasize > p_msc_ctx->current.blk_size * p_read6->xfrlen)
    {
        p_msc_ctx->current.residue = p_msc_ctx->current.blk_datasize -
                                     p_msc_ctx->current.blk_size * p_read6->xfrlen;
    }

    return cmd_read_start(p_inst, p_msc, p_msc_ctx);
}

static ret_code_t cmd_write_start(app_usbd_class_inst_t const * p_inst,
                                  app_usbd_msc_t const *        p_msc,
                                  app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("cmd_write_start");
    ret_code_t ret = transfer_out_start(p_inst,
                                        ((uint8_t *)p_msc->specific.inst.p_block_buff +
                                        p_msc_ctx->current.workbuff_pos),
                                        next_transfer_size_calc(p_msc_ctx),
                                        APP_USBD_MSC_STATE_DATA_OUT);

    if (ret == NRF_SUCCESS)
    {
        p_msc_ctx->current.trans_req_id = 0;
        APP_USBD_MSC_REQ_BUSY_SET(p_msc_ctx->current.req_busy_mask,
                                  p_msc_ctx->current.trans_req_id);
        p_msc_ctx->current.workbuff_pos ^= p_msc->specific.inst.block_buff_size;
        p_msc_ctx->current.trans_in_progress = true;
    }

    return ret;
}

/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_WRITE6 handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_write6(app_usbd_class_inst_t const * p_inst,
                             app_usbd_msc_t const *        p_msc,
                             app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: WRITE6");
    app_usbd_scsi_cmd_write6_t const * p_write6 = (const void *)p_msc_ctx->cbw.cdb;
    if (p_msc_ctx->cbw.cdb_length < sizeof(app_usbd_scsi_cmd_write6_t))
    {
        return unsupported_start(p_inst);
    }

    if (p_msc_ctx->cbw.lun >= p_msc->specific.inst.block_devs_count)
    {
        return unsupported_start(p_inst);
    }

    nrf_block_dev_t const * p_blkd = p_msc->specific.inst.pp_block_devs[p_msc_ctx->cbw.lun];

    p_msc_ctx->current.lun = p_msc_ctx->cbw.lun;
    p_msc_ctx->current.blk_idx = (p_write6->mslba & 0x1F << 16) |
                                  uint16_big_decode(p_write6->lslba);
    p_msc_ctx->current.blk_datasize = uint32_decode(p_msc_ctx->cbw.datlen);
    p_msc_ctx->current.blk_size = nrf_blk_dev_geometry(p_blkd)->blk_size;
    p_msc_ctx->current.blk_count = next_transfer_blkcnt_calc(p_msc, p_msc_ctx);

    if (p_msc_ctx->current.blk_datasize > p_msc_ctx->current.blk_size * p_write6->xfrlen)
    {
        p_msc_ctx->current.residue = p_msc_ctx->current.blk_datasize -
                                     p_msc_ctx->current.blk_size * p_write6->xfrlen;
    }

    return cmd_write_start(p_inst, p_msc, p_msc_ctx);
}

/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_INQUIRY handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_inquiry(app_usbd_class_inst_t const * p_inst,
                              app_usbd_msc_t const *        p_msc,
                              app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: INQUIRY");
    app_usbd_scsi_cmd_inquiry_t const * p_inq =  (const void *)p_msc_ctx->cbw.cdb;
    if (p_inq->pagecode != 0)
    {
        return unsupported_start(p_inst);
    }

    if (p_msc_ctx->cbw.lun >= p_msc->specific.inst.block_devs_count)
    {
        return unsupported_start(p_inst);
    }

    p_msc_ctx->resp_len = uint32_decode(p_msc_ctx->cbw.datlen);
    p_msc_ctx->resp_len = MIN(p_msc_ctx->resp_len,
                              sizeof(app_usbd_scsi_cmd_inquiry_resp_t));

    if (p_msc_ctx->resp_len == 0)
    {
        return csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_PASS);
    }


    p_msc_ctx->scsi_resp.inquiry.qualtype = APP_USBD_MSC_SCSI_INQ_QUAL_CONNECTED |
                                            APP_USBD_MSC_SCSI_INQ_TYPE_DIR_ACCESS;
    p_msc_ctx->scsi_resp.inquiry.flags1   = APP_USBD_MSC_SCSI_INQ_FLAG1_RMB;
    p_msc_ctx->scsi_resp.inquiry.version  = APP_USBD_SCSI_INQ_VER_SPC4;
    p_msc_ctx->scsi_resp.inquiry.flags2   = APP_USBD_MSC_SCSI_INQ_FLAG2_RSP_SPC2 |
                                            APP_USBD_MSC_SCSI_INQ_FLAG2_HISUP;
    p_msc_ctx->scsi_resp.inquiry.len      = sizeof(app_usbd_scsi_cmd_inquiry_resp_t) -
                                            offsetof(app_usbd_scsi_cmd_inquiry_resp_t, len);

    nrf_block_dev_t const * p_blkd = p_msc->specific.inst.pp_block_devs[p_msc_ctx->cbw.lun];
    nrf_block_dev_info_strings_t * p_strings = NULL;
    UNUSED_RETURN_VALUE(nrf_blk_dev_ioctl(p_blkd,
                        NRF_BLOCK_DEV_IOCTL_REQ_INFO_STRINGS,
                        &p_strings));

    if (p_strings)
    {
        UNUSED_RETURN_VALUE(strncpy((char *)p_msc_ctx->scsi_resp.inquiry.vendorid,
                            p_strings->p_vendor,
                            sizeof(p_msc_ctx->scsi_resp.inquiry.vendorid)));

        UNUSED_RETURN_VALUE(strncpy((char *)p_msc_ctx->scsi_resp.inquiry.productid,
                            p_strings->p_product,
                            sizeof(p_msc_ctx->scsi_resp.inquiry.productid)));

        UNUSED_RETURN_VALUE(strncpy((char *)p_msc_ctx->scsi_resp.inquiry.revision,
                            p_strings->p_revision,
                            sizeof(p_msc_ctx->scsi_resp.inquiry.revision)));
    }
    else {
        memset(p_msc_ctx->scsi_resp.inquiry.vendorid,
               0,
               sizeof(p_msc_ctx->scsi_resp.inquiry.vendorid));
        memset(p_msc_ctx->scsi_resp.inquiry.productid,
               0,
               sizeof(p_msc_ctx->scsi_resp.inquiry.productid));
        memset(p_msc_ctx->scsi_resp.inquiry.revision,
               0,
               sizeof(p_msc_ctx->scsi_resp.inquiry.revision));
    }

    return transfer_in_start(p_inst,
                             &p_msc_ctx->scsi_resp,
                             p_msc_ctx->resp_len,
                             APP_USBD_MSC_STATE_CMD_IN);
}

/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_MODESELECT6 handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_modeselect6(app_usbd_class_inst_t const * p_inst,
                                  app_usbd_msc_t const *        p_msc,
                                  app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: MODESELECT6");
    return csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_PASS);
}


/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_MODESENSE6 handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_modesense6(app_usbd_class_inst_t const * p_inst,
                                 app_usbd_msc_t const *        p_msc,
                                 app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: MODESENSE6");
    app_usbd_scsi_cmd_modesense6_t const * p_sense6 = (const void *)p_msc_ctx->cbw.cdb;
    UNUSED_VARIABLE(p_sense6);
    if (p_msc_ctx->cbw.cdb_length < sizeof(app_usbd_scsi_cmd_modesense6_t))
    {
        return unsupported_start(p_inst);
    }

    if (p_msc_ctx->cbw.lun >= p_msc->specific.inst.block_devs_count)
    {
        return unsupported_start(p_inst);
    }

    p_msc_ctx->resp_len = uint32_decode(p_msc_ctx->cbw.datlen);
    p_msc_ctx->resp_len = MIN(p_msc_ctx->resp_len,
                              sizeof(app_usbd_scsi_cmd_modesense6_resp_t));

